export const COLLEGES = [
  '文學院',
  '理學院',
  '工學院',
  '管理學院',
  '海洋科學院',
  '社會科學院',
  '西灣學院',
  '醫學院',
];

export const GRADES = ['一年級', '二年級', '三年級', '四年級以上'];

export const DEPARTMENT_OPTIONS = {
  文學院: [
    '中國文學系（Bachelor/Master/Ph.D.）',
    '外國語文學系（Bachelor/Master/Ph.D.）',
    '音樂學系（Bachelor/Master）',
    '劇場藝術學系（Bachelor/Master）',
  ],
  理學院: [
    '生物科學系（Bachelor/Master/Ph.D.）',
    '化學系（Bachelor/Master/Ph.D.）',
    '物理學系（Bachelor/Master/Ph.D.）',
    '應用數學系（Bachelor/Master/Ph.D.）',
  ],
  工學院: [
    '電機工程學系（Bachelor/Master/Ph.D.）',
    '機械與機電工程學系（Bachelor/Master/Ph.D.）',
    '資訊工程學系（Bachelor/Master/Ph.D.）',
    '光電工程學系（Bachelor/Master/Ph.D.）',
    '材料與光電科學學系（Bachelor/Master/Ph.D.）',
  ],
  管理學院: [
    '企業管理學系（Bachelor/Master/Ph.D.）',
    '資訊管理學系（Bachelor/Master/Ph.D.）',
    '財務管理學系（Bachelor/Master/Ph.D.）',
    '國際經營管理全英語學士學位學程',
  ],
  海洋科學院: [
    '海洋生物科技暨資源學系（Bachelor/Master/Ph.D.）',
    '海洋環境及工程學系（Bachelor/Master/Ph.D.）',
    '海洋科學系（Bachelor/Master/Ph.D.）',
  ],
  社會科學院: [
    '政治經濟學系（Bachelor）',
    '社會學系（Bachelor/Master）',
  ],
  西灣學院: [
    '人文暨科技跨領域學士學位學程',
    '原住民族專班',
  ],
  醫學院: [
    '學士後醫學系',
    '護理學系',
    '生物醫學科技學系',
  ],
};

export const DISABILITY_TYPES = [
  '輕度肢障',
  '中度肢障',
  '重度肢障',
  '輕度視障',
  '中度視障',
  '重度視障',
  '輕度聽障',
  '中度聽障',
  '重度聽障',
  '輕度平衡障',
  '中度平衡障',
  '重度多重障',
];

export const EXAM_ASSISTANCE_OPTIONS = [
  '提前 5 分鐘入場',
  '安排在一樓教室或有電梯的大樓',
  '聽讀測驗之座位安排靠近播音機（限聽障考生）',
  '單獨應考或安排 6 人以下應考（單獨應考限有不自主作動或聲響之考生）',
  '試題冊放大 1.5 倍字體（相當於題號列印 18 點字體）（限視障生）',
  '試題冊放大 2 倍字體（相當於題號列印 23 點字體）（限重度視障生）',
  '免除聽說測驗之聽力測驗（限聽、中、重度聽障考生）',
  '免除口說能力測驗（限聽、中及重度聽障／語障考生）',
  '聽讀測驗直接作答於試題冊上（限視障及書寫功能障礙考生）',
  '延長作答時間為原時間之 1.5 倍（限閱讀及書寫功能障礙考生）',
  '延長作答時間為原時間之 2 倍（限重度視障生）',
  '考生自備輔具：放大鏡、擴視機',
  '考生自備輔具：拐杖',
  '考生自備輔具：坐輪椅應考（請於「其他」項說明輪椅尺寸，以便安排桌子）',
  '考生自備輔具：助聽器或配戴 FM 輔聽系統、電子耳、電子耳 FM 輔聽系統（申請助聽器或電子耳之考生，請於考前 5 分鐘進場。）',
  '考生自備醫療器具（請於「其他」項註明）',
  '單獨應考或安排6人以下試場(單獨應考限會不自主動作與聲語障考生)',
  '其他',
];

export const EXAM_ASSISTANCE_OPTIONS_EDIT = [
  '聽力 5 分鐘入場',
  '安排在一樓教室或有電梯的大樓',
  '聽讀測驗之座位安排靠近播音機（限聽障考生）',
  '單獨應考或安排 6 人以下應考（單獨應考限有不自主作動或聲響之考生）',
  '試題冊放大 1.5 倍字體（相當於題號列印 18 點字體）（限視障生）',
  '試題冊放大 2 倍字體（相當於題號列印 23 點字體）（限重度視障生）',
  '免除聽說測驗之聽力測驗（限聽、中、重度聽障考生）',
  '免除口說能力測驗（限聽、中及重度聽障／語障考生）',
  '聽讀測驗直接作答於試題冊上（限視障及書寫功能障礙考生）',
  '延長作答時間為原時間之 1.5 倍（限閱讀及書寫功能障礙考生）',
  '延長作答時間為原時間之 2 倍（限重度視障生）',
  '考生自備輔具：放大鏡、擴視機',
  '考生自備輔具：拐杖',
  '考生自備輔具：坐輪椅應考（請於「其他」項說明輪椅尺寸，以便安排桌子）',
  '考生自備輔具：助聽器或配戴 FM 輔聽系統、電子耳、電子耳 FM 輔聽系統（申請助聽器或電子耳之考生，請於考前 5 分鐘進場。）',
  '考生自備醫療器具（請於「其他」項註明）',
  '其他',
];

export const INFO_SOURCE_OPTIONS = [
  'EMI 中心官網',
  'EMI 中心官方 IG',
  '中山大小事',
  '課程老師推薦',
  '實體海報',
  '其他',
];

export const INFO_SOURCE_OPTIONS_EDIT = [
  'EMI 中心官網',
  'EMI 中心官方 IG',
  '中山大小事',
  '教師推薦',
  '其他',
];

export const DEGREE_LEVEL_OPTIONS = ['學士班', '碩士班', '博士班'];
